visshal_virginia_controllers_project/routes_controllers/app/controllers/artworks_controller.rb

    def show
        render json: Artwork.find(params[:id])
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def update
        artwork = Artwork.find(params[:id])
         if artwork.update(artwork_params)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["title", "starry night"], ["updated_at", "2021-11-10 22:19:12.582985"], ["id", 2]]

    def favorite
        artwork = Artwork.find(params[:id])
        artwork.favorite = true
        artwork.save
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "artworks" SET "favorite" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["favorite", true], ["updated_at", "2021-11-11 18:45:02.590028"], ["id", 2]]

    def remove_favorite
        artwork = Artwork.find(params[:id])
        artwork.favorite = false
        artwork.save
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "artworks" SET "favorite" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["favorite", false], ["updated_at", "2021-11-11 18:45:17.502081"], ["id", 2]]