visshal_virginia_controllers_project/routes_controllers/app/controllers/artwork_shares_controller.rb

    def create
        artwork_share = ArtworkShare.new(artwork_share_params)
        if artwork_share.save
---
INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 2], ["viewer_id", 4], ["created_at", "2021-11-10 22:34:37.110478"], ["updated_at", "2021-11-10 22:34:37.110478"]]

    def destroy
        artwork_share = ArtworkShare.find(params[:id])
        artwork_share.destroy
---
SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 1]]

    def favorite
        artwork_share = ArtworkShare.find(params[:id])
        artwork_share.favorite = true
        artwork_share.save
---
SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "artwork_shares" SET "favorite" = $1, "updated_at" = $2 WHERE "artwork_shares"."id" = $3  [["favorite", true], ["updated_at", "2021-11-11 18:49:50.458272"], ["id", 1]]

    def remove_favorite
        artwork_share = ArtworkShare.find(params[:id])
        artwork_share.favorite = false
        artwork_share.save
---
SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "artwork_shares" SET "favorite" = $1, "updated_at" = $2 WHERE "artwork_shares"."id" = $3  [["favorite", false], ["updated_at", "2021-11-11 18:49:59.850218"], ["id", 1]]