visshal_virginia_controllers_project/routes_controllers/app/controllers/artworks_controller.rb

SELECT "artworks".* FROM "artworks"
---
   def index
        @artworks = Artwork.all