visshal_virginia_controllers_project/routes_controllers/app/controllers/collection_assignments_controller.rb

     def create
        collection_assignment = CollectionAssignment.new(collection_assignment_params)
        if collection_assignment.save
---
INSERT INTO "collection_assignments" ("collection_id", "artwork_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["collection_id", 1], ["artwork_id", 1], ["created_at", "2021-11-11 19:41:46.012483"], ["updated_at", "2021-11-11 19:41:46.012483"]]

    def destroy
        collection_assignment = CollectionAssignment.find(params[:id])
        collection_assignment.destroy
---
SELECT  "collection_assignments".* FROM "collection_assignments" WHERE "collection_assignments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "collection_assignments" WHERE "collection_assignments"."id" = $1  [["id", 1]]