visshal_virginia_controllers_project/routes_controllers/app/controllers/collections_controller.rb

    def index
        render json: Collection.all
---
SELECT "collections".* FROM "collections"