visshal_virginia_controllers_project/routes_controllers/app/controllers/comments_controller.rb

    def index
        if params[:user_id]
            render json: Comment.where(user_id: params[:user_id])
        elsif params[:artwork_id]
            render json: Comment.where(artwork_id: params[:artwork_id])
        else
            render json: Comment.all
---
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 1]]
SELECT "comments".* FROM "comments"

    def create
        comment = Comment.new(comment_params)
        if comment.save
---
INSERT INTO "comments" ("body", "user_id", "artwork_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "super cool art dude"], ["user_id", 3], ["artwork_id", 2], ["created_at", "2021-11-11 16:19:11.510635"], ["updated_at", "2021-11-11 16:19:11.510635"]]