visshal_virginia_controllers_project/routes_controllers/app/controllers/likes_controller.rb

    def index
        if params[:artwork_id]
            render json: Like.where(likeable_id: params[:artwork_id], likeable_type: 'Artwork')
        elsif params[:comment_id]
            render json: Like.where(likeable_id: params[:comment_id], likeable_type: 'Comment')
        elsif params[:user_id]
            render json: Like.where(user_id: params[:user_id])
        else
            render json: Like.all
---
SELECT "likes".* FROM "likes" WHERE "likes"."likeable_id" = $1 AND "likes"."likeable_type" = $2  [["likeable_id", 2], ["likeable_type", "Artwork"]]
SELECT "likes".* FROM "likes" WHERE "likes"."likeable_id" = $1 AND "likes"."likeable_type" = $2  [["likeable_id", 2], ["likeable_type", "Comment"]]
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = $1  [["user_id", 1]]
SELECT "likes".* FROM "likes"

    def create
        if params[:artwork_id]
            like = Like.new(user_id: params[:user_id], likeable_id: params[:artwork_id], likeable_type: 'Artwork')
        elsif params[:comment_id]
            like = Like.new(user_id: params[:user_id], likeable_id: params[:comment_id], likeable_type: 'Comment')
        else
            like = Like.new(like_params)
        end

        if like.save
---
INSERT INTO "likes" ("user_id", "likeable_type", "likeable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 4], ["likeable_type", "Comment"], ["likeable_id", 1], ["created_at", "2021-11-11 20:02:43.828602"], ["updated_at", "2021-11-11 20:02:43.828602"]]