visshal_virginia_controllers_project/routes_controllers/app/controllers/users_controller.rb

    def update
        user = User.find(params[:id])
         if user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "john"], ["email", "kink@gmail.com"], ["updated_at", "2021-11-10 21:04:10.881492"], ["id", 1]]